# homeworkcoffee.py

money, sel = 0, 9

money = int(input('금액입력>>>'))
bal = money # 잔액
while True :
    print('-------커피머신-------')
    print('')

    print('현재 잔액', bal,'원')
    data = int(input('1.커피(250) 2.코코아(200) 3.반환 9:종료>>>'))
    sel = int(data)
    #if~elif~if제어문 커피값 계산
    if sel == 1 :
        if bal >= 250 :
            bal = bal - 250
            print('----------------------------')
            print('커피 주문 성공 잔액 :',bal,'원')
            print('----------------------------')
        else :
            print('----------------------------')
            print('커피 주문 실패 현재 잔액 :',bal,'원')
            print('----------------------------')
    elif sel ==2 :
        if bal >= 200 :
            bal = bal - 200
            print('----------------------------')
            print('코코아 주문 성공 잔액 :',bal,'원')
            print('----------------------------')
        else :
            print('----------------------------')
            print('코코아 주문 실패 현재 잔액 :',bal,'원')
            print('----------------------------')
    elif sel == 3 :
        print('----------------------------')
        print('잔액을 반환합니다. ')
        print('현재 잔액 :',bal,'원 반환합니다. ')
        print('----------------------------')
        break
    elif sel == 9 :
        print('----------------------------')
        print('커피 자판기를 종료합니다. ')
        print('현재잔액은 ', bal, '입니다.')
        print('----------------------------')
        break

